/*******************************************************************
Algorithm Study
Baekjoon SW 역량테스트 준비 기초
11726 2*n 타일링 
2021/07/27 이호준
# 아이디어
1. i와 i-1과의 관계를 찾아보다보니 피보나치였다.
2. Why 피보나치 수열?
   f(n) = f(n-1) + f(n-2);
   맨 뒤에 1*2 타일은 하나 놓았다고 생각하면 f(n-2)
   맨 뒤에 2*1 타일을 하나 놓았다고 생각하면 f(n-1)
※ 맨 처음 시도에서는 마지막에 %10007로 나누어줬는데 중간에 값이 커지면서 overflow가 발생하는 경우가 있는 것 같다.
   mod 연산은 어디서 해도 같은 결과를 주므로 for문안에서 진행하였다.
*******************************************************************/
#include <iostream>
#include <string>
#include <vector>

using namespace std;

int main(void)
{
    int n;
    cin >> n;
    vector<int> min(n + 1, 0);
    if (n == 1)
    {
        cout << 1;
        return 0;
    }
    min[1] = 1;
    min[2] = 2;
    for (int i = 2; i < n; i++)
    {
        if (i + 1 < n + 1)
        {
            min[i + 1] = min[i] + min[i - 1];
            min[i + 1] %= 10007;
        }
    }
    cout << min[n];
    return 0;
}
/*
000000

0000

0 1
00 2
000 3
0000 5

00000
4+3+1 8

000000
5 + 6 + 1 + 1
*/