#include <iostream>
using namespace std;

/*
 
2021.07.26 서혜민

m이 2보다 작거나 n이 2보다 작은 경우에는 어떠한 방향으로도 움직일 수 없으므로
방문 지점은 시작점(1,1)이 유일하고

세로인 n이 2일때는 (+2,+1)과 (+2, -1)로 움직일 수 있으므로,
가로인 m에 따라서 갈 수 있는 지점의 수가 달라지므로 이동 횟수가 4보다 커지면
방문 지점은 4가 된다.

마지막으로 n이 2보다 클 때는 (+1,+2)와 (+1,-2)로도 움직일 수 있지만
4가지 방향으로 모두 가기 위해서는 m이 1에 6(1+1+2+2)을 더한 7보다 크거나 같아야하므로
m이 그 아래일 때는 이동 횟수가 4보다 커지면 방문 지점은 4가되며
m이 7 이상일 때는 m이 7까지 일때는 모든 방향으로 이동하는 총 4가지에
(+1,+2)과 (+1,-2)같은 가로로 +1방향으로 갈 수 있는 경우를 더해주므로 총 지점은 m-2개가 된다.

*/

int main() {
	int n, m;//세로, 가로
	cin >> n >> m;
	if (n < 2 || m < 2) cout << 1 << endl;
	else if (n == 2) {
		if ((m - 1) / 2 < 4) cout << (m - 1) / 2 + 1 << endl;
		else cout << 4 << endl;
	}
	else {
		if (m <7) {
			if (m <= 4) cout << m << endl;
			else cout << 4 << endl;
		}
		else {
			cout << m - 2 << endl;
		}
	}
}